# pandas cheat sheet

#### Importing modules

In [38]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import matplotlib.pyplot as plt

####

#### Series

In [39]:
s1 = Series(range(0, 5))
odd_s2 = Series(range(1, 6))
even_s2 = Series(range(2, 7))
s3 = s1 + even_s2 
print(s3)

0     2
1     4
2     6
3     8
4    10
dtype: int64

### DataFrame
#### get csv from an URL

In [40]:
df = DataFrame()
df = pd.read_csv('https://support.staffbase.com/hc/en-us/article_attachments/360009197031/username.csv', 
sep=';', header=0, index_col=0, na_values=['na', '', '-', '.']) 
display(df)
df.info()

            Identifier First name Last name
Username
booker12          9012     Rachel    Booker
grey07            2070      Laura      Grey
johnson81         4081      Craig   Johnson
jenkins46         9346       Mary   Jenkins
smith79           5079      Jamie     Smith

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, booker12 to smith79
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0    Identifier  5 non-null      int64
 1   First name   5 non-null      object
 2   Last name    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 160.0+ bytes

##

#### Load a data frame from a module with data

In [41]:
from ISLP import load_data
Auto = load_data('Auto')
if 1:
    display(Auto.shape, Auto.head(2), Auto.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392 entries, 0 to 391
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    int64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   year          392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
dtypes: float64(3), int64(5), object(1)
memory usage: 27.7+ KB

(392, 9)

,mpg,cylinders,displacement,horsepower,weight,acceleration,year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320

None

from ISLP import load_data
Wage = load_data('Wage')
if 1:
    display(Wage.shape, Wage.head(2), Wage.info())

In [48]:
import pandas as pd
wb_df = pd.ExcelFile('~/.local/share/Trash/files/MasterBiomedicineJGU_mod1.a_WiSe23/exams/exam_22.12.2022/students_exams/Bioinformatics MSc module Dec 2022_7_formarking_EM.xlsx')
d = {}
for sheet in wb_df.sheet_names:
    df = wb_df.parse(sheet)
    display(sheet, df.head(2))

'Sheet1'

,Key,Matrikel nr,Nachname,Vorname,email,seminar,Q1 EM Python,Q2 EM/PM,Q3 MA,Q4 ST/UD,...,Q7 FM,Q8 MSp/SA,Q9 MSp/SA,Q10 MC,Q11 EV,Notes,exam received,File Name,Exam pts,Total pts
0,35,2725728,Reiner,Julia Salomea,rjuliasa@students.uni-mainz.de,4.5,2,2,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,yes,2725728_Reiner.pdf,NaN,NaN
1,38,2733610,Thews,Leonhard Tankred,lthews@students.uni-mainz.de,5.0,6,6,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,yes (from gmail),2733610_Thews.pdf,NaN,NaN